v2206/atmospheric_Microclimate/streetCanyon_CFDHAM_grass/system/street/setset.batch
cellSet soil new boxToCell (60.0 -2.0 100.0)(70.0 0 150.0)
cellZoneSet soil new setToCellZone soil
