v2206/atmospheric_Microclimate/streetCanyon_CFDHAM_grass/system/windward/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
  (70.00 0.00 100.00)
  (70.09 0.00 100.00)
  (70.09 10.00 100.00)
  (70.00 10.00 100.00)
  (70.00 0.00 150.00)
  (70.09 0.00 150.00)
  (70.09 10.00 150.00)
  (70.00 10.00 150.00)
);
 
blocks
(
  hex (0 1 2 3 4 5 6 7) (20 20 100) simpleGrading (((0.5 0.5 10)(0.5 0.5 0.1)) 1 1)
);
 
edges
(
);
 
boundary
(
    windward_to_air
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    
    interior
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    
    top
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }
    
    bottom
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    
    sides
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
    
);
 
mergePatchPairs
(
);

// ************************************************************************* //
