v2206/atmospheric_Microclimate/streetCanyon_CFDHAM_grass/system/windward/setset.batch
cellSet brick new boxToCell (70.0 0 100.0)(70.1 10.0 150.0)
cellZoneSet brick new setToCellZone brick